Continued apply output from previous comment.
<details><summary>Show Output</summary>

```diff
ds on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "lambda-getGenomicVariants" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + "arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-splitQuery",
            ]
        }
      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + "arn:aws:sns:ap-southeast-3:496940679572:splitQuery",
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
              + "s3:ListBucket",
            ]
          + resources = [
              + "*",
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.lambda-getIndividuals will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "lambda-getIndividuals" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
              + "s3:ListBucket",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + "arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-splitQuery",
            ]
        }
      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + "arn:aws:sns:ap-southeast-3:496940679572:splitQuery",
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.lambda-getProjects will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "lambda-getProjects" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:DescribeTable",
              + "dynamodb:GetItem",
              + "dynamodb:Query",
              + "dynamodb:Scan",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:496940679572:table/sbeacon-dataportal-projects",
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.lambda-getRuns will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "lambda-getRuns" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
              + "s3:ListBucket",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + "arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-splitQuery",
            ]
        }
      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + "arn:aws:sns:ap-southeast-3:496940679572:splitQuery",
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.lambda-splitQuery will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "lambda-splitQuery" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + "arn:aws:lambda:ap-southeast-3:496940679572:function:sbeacon-backend-performQuery",
            ]
        }
      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + "arn:aws:sns:ap-southeast-3:496940679572:performQuery",
            ]
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.lambda-updateFiles will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "lambda-updateFiles" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::gaspi-dataportal20250519062439005900000006",
            ]

          + condition {
              + test     = "StringLike"
              + values   = [
                  + "projects/*/project-files/*",
                  + "staging/projects/*/project-files/*",
                ]
              + variable = "s3:prefix"
            }
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::gaspi-dataportal20250519062439005900000006/projects/*/project-files/*",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:496940679572:table/sbeacon-dataportal-clinic-jobs",
              + "arn:aws:dynamodb:ap-southeast-3:496940679572:table/sbeacon-dataportal-projects",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:BatchGetItem",
              + "dynamodb:DeleteItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:496940679572:table/sbeacon-vcfs",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:Query",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:496940679572:table/sbeacon-dataportal-clinic-jobs",
              + "arn:aws:dynamodb:ap-southeast-3:496940679572:table/sbeacon-dataportal-clinic-jobs/index/project-name-index",
            ]
        }
    }

  # module.sbeacon.aws_api_gateway_rest_api.BeaconApi will be updated in-place
  ~ resource "aws_api_gateway_rest_api" "BeaconApi" {
        id                           = "q5k7basu44"
        name                         = "sbeacon-backend-api"
      ~ tags                         = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all                     = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.sbeacon.aws_api_gateway_stage.BeaconApi will be updated in-place
  ~ resource "aws_api_gateway_stage" "BeaconApi" {
        id                    = "ags-q5k7basu44-prod"
      ~ tags                  = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)
    }

  # module.sbeacon.aws_athena_workgroup.sbeacon-workgroup will be updated in-place
  ~ resource "aws_athena_workgroup" "sbeacon-workgroup" {
        id            = "query_workgroup"
        name          = "query_workgroup"
      ~ tags          = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all      = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.sbeacon.aws_cloudformation_stack.sbeacon_terms_index_stack will be updated in-place
  ~ resource "aws_cloudformation_stack" "sbeacon_terms_index_stack" {
        id                 = "arn:aws:cloudformation:ap-southeast-3:496940679572:stack/sbeacon-terms-index-stack/1511381a-f1c3-49e3-b711-d32cc243a0ca"
        name               = "sbeacon-terms-index-stack"
      ~ outputs            = {} -> (known after apply)
      ~ tags               = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all           = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_cloudformation_stack.sbeacon_terms_stack will be updated in-place
  ~ resource "aws_cloudformation_stack" "sbeacon_terms_stack" {
        id                 = "arn:aws:cloudformation:ap-southeast-3:496940679572:stack/sbeacon-terms-stack/3b88f7b0-00f0-49bc-a975-333b79eae86e"
        name               = "sbeacon-terms-stack"
      ~ outputs            = {} -> (known after apply)
      ~ tags               = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all           = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_cloudfront_distribution.api_distribution will be updated in-place
  ~ resource "aws_cloudfront_distribution" "api_distribution" {
        id                              = "E3CNFIRWQL8B5C"
      ~ tags                            = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all                        = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (23 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.aws_dynamodb_table.anscestor_terms will be updated in-place
  ~ resource "aws_dynamodb_table" "anscestor_terms" {
        id                          = "sbeacon-Anscestors"
        name                        = "sbeacon-Anscestors"
      ~ tags                        = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
            "backup"      = "true"
        }
      ~ tags_all                    = {
          ~ "Environment" = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.aws_dynamodb_table.clinic_jobs will be updated in-place
  ~ resource "aws_dynamodb_table" "clinic_jobs" {
        id                          = "sbeacon-dataportal-clinic-jobs"
        name                        = "sbeacon-dataportal-clinic-jobs"
      ~ tags                        = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
            "backup"      = "true"
        }
      ~ tags_all                    = {
          ~ "Environment" = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.sbeacon.aws_dynamodb_table.clinical_annotations will be updated in-place
  ~ resource "aws_dynamodb_table" "clinical_annotations" {
        id                          = "sbeacon-dataportal-clinical-annotations"
        name                        = "sbeacon-dataportal-clinical-annotations"
      ~ tags                        = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
            "backup"      = "true"
        }
      ~ tags_all                    = {
          ~ "Environment" = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.aws_dynamodb_table.clinical_variants will be updated in-place
  ~ resource "aws_dynamodb_table" "clinical_variants" {
        id                          = "sbeacon-dataportal-clinical-variants"
        name                        = "sbeacon-dataportal-clinical-variants"
      ~ tags                        = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
            "backup"      = "true"
        }
      ~ tags_all                    = {
          ~ "Environment" = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.aws_dynamodb_table.dataportal_locks_table will be updated in-place
  ~ resource "aws_dynamodb_table" "dataportal_locks_table" {
        id                          = "sbeacon-dataportal-mutex-locks"
        name                        = "sbeacon-dataportal-mutex-locks"
      ~ tags                        = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
            "backup"      = "true"
        }
      ~ tags_all                    = {
          ~ "Environment" = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.aws_dynamodb_table.dataportal_pricing_cache will be updated in-place
  ~ resource "aws_dynamodb_table" "dataportal_pricing_cache" {
        id                          = "sbeacon-dataportal-pricing-cache"
        name                        = "sbeacon-dataportal-pricing-cache"
      ~ tags                        = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
            "backup"      = "true"
        }
      ~ tags_all                    = {
          ~ "Environment" = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.aws_dynamodb_table.descendant_terms will be updated in-place
  ~ resource "aws_dynamodb_table" "descendant_terms" {
        id                          = "sbeacon-Descendants"
        name                        = "sbeacon-Descendants"
      ~ tags                        = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
            "backup"      = "true"
        }
      ~ tags_all                    = {
          ~ "Environment" = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.aws_dynamodb_table.juptyer_notebooks will be updated in-place
  ~ resource "aws_dynamodb_table" "juptyer_notebooks" {
        id                          = "sbeacon-dataportal-juptyer-notebooks"
        name                        = "sbeacon-dataportal-juptyer-notebooks"
      ~ tags                        = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
            "backup"      = "true"
        }
      ~ tags_all                    = {
          ~ "Environment" = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.aws_dynamodb_table.ontologies will be updated in-place
  ~ resource "aws_dynamodb_table" "ontologies" {
        id                          = "sbeacon-Ontologies"
        name                        = "sbeacon-Ontologies"
      ~ tags                        = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
            "backup"      = "true"
        }
      ~ tags_all                    = {
          ~ "Environment" = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.aws_dynamodb_table.project_users will be updated in-place
  ~ resource "aws_dynamodb_table" "project_users" {
        id                          = "sbeacon-dataportal-project-users"
        name                        = "sbeacon-dataportal-project-users"
      ~ tags                        = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
            "backup"      = "true"
        }
      ~ tags_all                    = {
          ~ "Environment" = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.sbeacon.aws_dynamodb_table.projects will be updated in-place
  ~ resource "aws_dynamodb_table" "projects" {
        id                          = "sbeacon-dataportal-projects"
        name                        = "sbeacon-dataportal-projects"
      ~ tags                        = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
            "backup"      = "true"
        }
      ~ tags_all                    = {
          ~ "Environment" = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.aws_dynamodb_table.saved_queries will be updated in-place
  ~ resource "aws_dynamodb_table" "saved_queries" {
        id                          = "sbeacon-dataportal-saved-queries"
        name                        = "sbeacon-dataportal-saved-queries"
      ~ tags                        = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
            "backup"      = "true"
        }
      ~ tags_all                    = {
          ~ "Environment" = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.aws_dynamodb_table.sbeacon_dataportal_users_info will be updated in-place
  ~ resource "aws_dynamodb_table" "sbeacon_dataportal_users_info" {
        id                          = "sbeacon-dataportal-users-info"
        name                        = "sbeacon-dataportal-users-info"
      ~ tags                        = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
            "backup"      = "true"
        }
      ~ tags_all                    = {
          ~ "Environment" = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.aws_dynamodb_table.vcfs will be updated in-place
  ~ resource "aws_dynamodb_table" "vcfs" {
        id                          = "sbeacon-vcfs"
        name                        = "sbeacon-vcfs"
      ~ tags                        = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
            "backup"      = "true"
        }
      ~ tags_all                    = {
          ~ "Environment" = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.aws_glue_catalog_database.metadata-database will be updated in-place
  ~ resource "aws_glue_catalog_database" "metadata-database" {
        id           = "496940679572:sbeacon_metadata"
        name         = "sbeacon_metadata"
      ~ tags         = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all     = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.sbeacon.aws_glue_crawler.sbeacon-crawler will be updated in-place
  ~ resource "aws_glue_crawler" "sbeacon-crawler" {
        id                     = "sbeacon-crawler"
        name                   = "sbeacon-crawler"
      ~ tags                   = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all               = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.sbeacon.aws_iam_instance_profile.ec2_deidentification_instance_profile will be updated in-place
  ~ resource "aws_iam_instance_profile" "ec2_deidentification_instance_profile" {
        id          = "sbeacon_backend_ec2_deidentification_instance_profile"
        name        = "sbeacon_backend_ec2_deidentification_instance_profile"
      ~ tags        = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all    = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_iam_policy.extra-glue-policy will be updated in-place
  ~ resource "aws_iam_policy" "extra-glue-policy" {
        id               = "arn:aws:iam::496940679572:policy/extra-glue-policy"
        name             = "extra-glue-policy"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:ListBucket",
                          - "s3:ListAllMyBuckets",
                          - "s3:GetObject",
                          - "s3:GetBucketLocation",
                          - "s3:GetBucketAcl",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::gaspi-metadata20250519061956402900000002/*",
                          - "arn:aws:s3:::gaspi-metadata20250519061956402900000002",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      ~ tags             = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all         = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)
    }

  # module.sbeacon.aws_iam_role.ec2_deidentification_instance_role will be updated in-place
  ~ resource "aws_iam_role" "ec2_deidentification_instance_role" {
        id                    = "sbeacon_backend_ec2_deidentification_instance_role"
        name                  = "sbeacon_backend_ec2_deidentification_instance_role"
      ~ tags                  = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.sbeacon.aws_iam_role.glue_role will be updated in-place
  ~ resource "aws_iam_role" "glue_role" {
        id                    = "glue_role"
        name                  = "glue_role"
      ~ tags                  = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # module.sbeacon.aws_iam_role.sagemaker_jupyter_instance_role will be updated in-place
  ~ resource "aws_iam_role" "sagemaker_jupyter_instance_role" {
        id                    = "sbeacon_backend_sagemaker_jupyter_instance_role"
        name                  = "sbeacon_backend_sagemaker_jupyter_instance_role"
      ~ tags                  = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # module.sbeacon.aws_iam_role_policy.ec2_deidentification_policy will be updated in-place
  ~ resource "aws_iam_role_policy" "ec2_deidentification_policy" {
        id          = "sbeacon_backend_ec2_deidentification_instance_role:sbeacon_backend_ec2_deidentification_policy"
        name        = "sbeacon_backend_ec2_deidentification_policy"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:ListBucket"
                      - Condition = {
                          - StringLike = {
                              - "s3:prefix" = [
                                  - "projects/*/project-files/*",
                                  - "staging/projects/*/project-files/*",
                                ]
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = "arn:aws:s3:::gaspi-dataportal20250519062439005900000006"
                    },
                  - {
                      - Action   = [
                          - "s3:GetObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::gaspi-dataportal20250519062439005900000006/staging/projects/*/project-files/*"
                    },
                  - {
                      - Action   = "s3:PutObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::gaspi-dataportal20250519062439005900000006/projects/*/project-files/*"
                    },
                  - {
                      - Action   = "dynamodb:UpdateItem"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ap-southeast-3:496940679572:table/sbeacon-vcfs",
                          - "arn:aws:dynamodb:ap-southeast-3:496940679572:table/sbeacon-dataportal-projects",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.aws_lambda_layer_version.binaries_layer must be replaced
+/- resource "aws_lambda_layer_version" "binaries_layer" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_binaries_layer:4" -> (known after apply)
      ~ code_sha256                 = "eA0JYBY7ezsMIoiSv2UNCG69xmc2XuyOl2Jfo/sYSpw=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-07-15T04:02:40.966+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_binaries_layer:4" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:496940679572:layer:sbeacon_backend_binaries_layer" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "oJ45UZzOUuxEmFmKRwGWhuiPxO4xoYscK0rCDtSk9KVQpM+L6crBhVczHhhfCf9u15jkxLyW5cG4gxC1JIrSow==" -> (known after apply) # forces replacement
      ~ source_code_size            = 18422349 -> (known after apply)
      ~ version                     = "4" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.aws_s3_bucket.dataportal-bucket will be updated in-place
  ~ resource "aws_s3_bucket" "dataportal-bucket" {
        id                          = "gaspi-dataportal20250519062439005900000006"
      ~ tags                        = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
            "backup"      = "true"
        }
      ~ tags_all                    = {
          ~ "Environment" = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.sbeacon.aws_s3_bucket.lambda-layers-bucket will be updated in-place
  ~ resource "aws_s3_bucket" "lambda-layers-bucket" {
        id                          = "gaspi-lambda-layers20250519061959773600000003"
      ~ tags                        = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all                    = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.aws_s3_bucket.metadata-bucket will be updated in-place
  ~ resource "aws_s3_bucket" "metadata-bucket" {
        id                          = "gaspi-metadata20250519061956402900000002"
      ~ tags                        = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
            "backup"      = "true"
        }
      ~ tags_all                    = {
          ~ "Environment" = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (7 unchanged blocks hidden)
    }

  # module.sbeacon.aws_s3_bucket.variants-bucket will be updated in-place
  ~ resource "aws_s3_bucket" "variants-bucket" {
        id                          = "gaspi-variants20250519061954938500000001"
      ~ tags                        = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "sbeacon-backend"
            "Owner"       = "gaspi"
        }
      ~ tags_all                    = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.aws_s3_bucket_notification.updateFiles will be updated in-place
  ~ resource "aws_s3_bucket_notification" "updateFiles" {
      ~ eventbridge = true -> false
        id          = "gaspi-dataportal20250519062439005900000006"
        # (2 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.sbeacon.aws_sagemaker_notebook_instance_lifecycle_configuration.sagemaker_jupyter_instance_lcc will be updated in-place
  ~ resource "aws_sagemaker_notebook_instance_lifecycle_configuration" "sagemaker_jupyter_instance_lcc" {
        id        = "clone-gaspi-notebooks"
        name      = "clone-gaspi-notebooks"
      ~ tags      = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all  = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)
    }

  # module.sbeacon.aws_sns_topic.performQuery will be updated in-place
  ~ resource "aws_sns_topic" "performQuery" {
        id                                       = "arn:aws:sns:ap-southeast-3:496940679572:performQuery"
        name                                     = "performQuery"
      ~ tags                                     = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all                                 = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (30 unchanged attributes hidden)
    }

  # module.sbeacon.aws_sns_topic.splitQuery will be updated in-place
  ~ resource "aws_sns_topic" "splitQuery" {
        id                                       = "arn:aws:sns:ap-southeast-3:496940679572:splitQuery"
        name                                     = "splitQuery"
      ~ tags                                     = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all                                 = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (30 unchanged attributes hidden)
    }

  # module.sbeacon.null_resource.init_script must be replaced
+/- resource "null_resource" "init_script" {
      ~ id       = "1534911731" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "script_hash" = "2fd01ae235e903cd1abfd015bc9151fcfd1d6322" -> "fae82dadb80f46eacffb27e35880738cb715d327"
        }
    }

  # module.security.aws_wafv2_web_acl.security-all-cloudfront will be updated in-place
  ~ resource "aws_wafv2_web_acl" "security-all-cloudfront" {
        id                          = "3942cb03-ef28-4aa6-9ca8-7a1275cfb998"
        name                        = "security-all-cloudfront"
      ~ tags                        = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all                    = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (9 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.webgui.data.aws_iam_policy_document.s3_access_from_cloudfront will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "s3_access_from_cloudfront" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::webgui-bucket-20250507095514592000000001/*",
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "arn:aws:cloudfront::496940679572:distribution/EKHY2BX6DAHID",
                ]
              + variable = "AWS:SourceArn"
            }

          + principals {
              + identifiers = [
                  + "cloudfront.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.webgui.aws_cloudfront_distribution.bui-s3-distribution will be updated in-place
  ~ resource "aws_cloudfront_distribution" "bui-s3-distribution" {
        id                              = "EKHY2BX6DAHID"
      ~ tags                            = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "portal-frontend"
            "Owner"       = "gaspi"
        }
      ~ tags_all                        = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (23 unchanged attributes hidden)

        # (6 unchanged blocks hidden)
    }

  # module.webgui.aws_s3_bucket.bui-hosted-bucket will be updated in-place
  ~ resource "aws_s3_bucket" "bui-hosted-bucket" {
        id                          = "webgui-bucket-20250507095514592000000001"
      ~ tags                        = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "portal-frontend"
            "Owner"       = "gaspi"
        }
      ~ tags_all                    = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.webgui.aws_s3_bucket_policy.s3_access_from_cloudfront will be updated in-place
  ~ resource "aws_s3_bucket_policy" "s3_access_from_cloudfront" {
        id     = "webgui-bucket-20250507095514592000000001"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetObject"
                      - Condition = {
                          - StringEquals = {
                              - "AWS:SourceArn" = "arn:aws:cloudfront::496940679572:distribution/EKHY2BX6DAHID"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "cloudfront.amazonaws.com"
                        }
                      - Resource  = "arn:aws:s3:::webgui-bucket-20250507095514592000000001/*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.webgui.aws_s3_object.version will be updated in-place
  ~ resource "aws_s3_object" "version" {
      ~ content                       = "v0.17.1-alpha-3-g1dc276f" -> "v0.17.1-alpha-111-gc7bdb5a+"
        id                            = "version.txt"
      ~ tags                          = {
          - "Environment" = "dev" -> null
        }
      ~ tags_all                      = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
      + version_id                    = (known after apply)
        # (24 unchanged attributes hidden)
    }

  # module.webgui.aws_ssm_parameter.bui-ssm-beacon-ui-url will be updated in-place
  ~ resource "aws_ssm_parameter" "bui-ssm-beacon-ui-url" {
        id              = "bui-ssm-beacon-ui-url"
        name            = "bui-ssm-beacon-ui-url"
      ~ tags            = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "portal-frontend"
            "Owner"       = "gaspi"
        }
      ~ tags_all        = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)
    }

  # module.webgui.null_resource.cloudfront-invalidate must be replaced
-/+ resource "null_resource" "cloudfront-invalidate" {
      ~ id       = "8233324222109232904" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "compiled_code_hash" = "8c4509cdde32956c71178c419e470ae5646a895a" -> "1058e1b3a683c424f1d466ddbeade3351f07eeab"
        }
    }

  # module.webgui.null_resource.s3-upload must be replaced
-/+ resource "null_resource" "s3-upload" {
      ~ id       = "4778776471649352874" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "build_file_hash"    = "892f738d6a75c9a463120bba9ae1147b02f43b74" -> "caab493802eac5ae99fb1979ad045b4f3c946757"
          ~ "compiled_code_hash" = "8c4509cdde32956c71178c419e470ae5646a895a" -> "1058e1b3a683c424f1d466ddbeade3351f07eeab"
        }
    }

  # module.webgui.terraform_data.cloudfront-version-invalidate must be replaced
-/+ resource "terraform_data" "cloudfront-version-invalidate" {
      ~ id               = "e88f0f6c-2a49-d39e-2860-73bd6d0e0c4c" -> (known after apply)
      ~ triggers_replace = [
          ~ "v0.17.1-alpha-3-g1dc276f" -> "v0.17.1-alpha-111-gc7bdb5a+",
        ]
    }

  # module.cognito.module.lambda-customMessageLambdaTrigger.aws_cloudwatch_log_group.lambda[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/cognito-customMessageLambdaTrigger"
        name              = "/aws/lambda/cognito-customMessageLambdaTrigger"
      ~ tags              = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "cognito-infrastructure"
            "Owner"       = "gaspi"
        }
      ~ tags_all          = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.cognito.module.lambda-customMessageLambdaTrigger.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
        id                    = "cognito-customMessageLambdaTrigger"
        name                  = "cognito-customMessageLambdaTrigger"
      ~ tags                  = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "cognito-infrastructure"
            "Owner"       = "gaspi"
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.cognito.module.lambda-customMessageLambdaTrigger.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cognito-customMessageLambdaTrigger"
      ~ tags                           = {
          ~ "Environment"           = "dev" -> "uat"
            "NAME"                  = "cognito-infrastructure"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      ~ tags_all                       = {
          ~ "Environment"           = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (28 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4151098165358902809" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1747635363939886000" -> "1754022865475387000"
            # (1 unchanged element hidden)
        }
    }

  # module.cognito.module.lambda-logEmailDelivery.aws_cloudwatch_log_group.lambda[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/cognito-logEmailDelivery"
        name              = "/aws/lambda/cognito-logEmailDelivery"
      ~ tags              = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "cognito-infrastructure"
            "Owner"       = "gaspi"
        }
      ~ tags_all          = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.cognito.module.lambda-logEmailDelivery.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
        id                    = "cognito-logEmailDelivery"
        name                  = "cognito-logEmailDelivery"
      ~ tags                  = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "cognito-infrastructure"
            "Owner"       = "gaspi"
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.cognito.module.lambda-logEmailDelivery.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cognito-logEmailDelivery"
      ~ tags                           = {
          ~ "Environment"           = "dev" -> "uat"
            "NAME"                  = "cognito-infrastructure"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      ~ tags_all                       = {
          ~ "Environment"           = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (28 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "3092658135797245752" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1747635364436872000" -> "1754022864977428000"
            # (1 unchanged element hidden)
        }
    }

  # module.cognito.module.lambda-sendClinicJobEmail.aws_cloudwatch_log_group.lambda[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/cognito-sendClinicJobEmail"
        name              = "/aws/lambda/cognito-sendClinicJobEmail"
      ~ tags              = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "cognito-infrastructure"
            "Owner"       = "gaspi"
        }
      ~ tags_all          = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.cognito.module.lambda-sendClinicJobEmail.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
        id                    = "cognito-sendClinicJobEmail"
        name                  = "cognito-sendClinicJobEmail"
      ~ tags                  = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "cognito-infrastructure"
            "Owner"       = "gaspi"
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.cognito.module.lambda-sendClinicJobEmail.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cognito-sendClinicJobEmail"
      ~ tags                           = {
          ~ "Environment"           = "dev" -> "uat"
            "NAME"                  = "cognito-infrastructure"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      ~ tags_all                       = {
          ~ "Environment"           = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (28 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "SES_SOURCE_EMAIL"    = "dian.larasaty@xapiens.id" -> "gxcgaspi@gmail.com"
                # (2 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.cognito.module.lambda-sendClinicJobEmail.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8839831099917665927" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1751933410423969000" -> "1754022864962357000"
            # (1 unchanged element hidden)
        }
    }

  # module.cognito.module.lambda-sendRegistrationEmail.aws_cloudwatch_log_group.lambda[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/cognito-sendRegistrationEmail"
        name              = "/aws/lambda/cognito-sendRegistrationEmail"
      ~ tags              = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "cognito-infrastructure"
            "Owner"       = "gaspi"
        }
      ~ tags_all          = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.cognito.module.lambda-sendRegistrationEmail.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
        id                    = "cognito-sendRegistrationEmail"
        name                  = "cognito-sendRegistrationEmail"
      ~ tags                  = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "cognito-infrastructure"
            "Owner"       = "gaspi"
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.cognito.module.lambda-sendRegistrationEmail.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cognito-sendRegistrationEmail"
      ~ tags                           = {
          ~ "Environment"           = "dev" -> "uat"
            "NAME"                  = "cognito-infrastructure"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      ~ tags_all                       = {
          ~ "Environment"           = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (28 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "SES_SOURCE_EMAIL"    = "dian.larasaty@xapiens.id" -> "gxcgaspi@gmail.com"
                # (2 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "879875869801693502" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1747635364455423200" -> "1754022864228736000"
            # (1 unchanged element hidden)
        }
    }

  # module.error-catcher.module.lambda-notifyOnError.aws_cloudwatch_log_group.lambda[0] will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "lambda" {
        id                = "/aws/lambda/error-catcher-notifyOnError"
        name              = "/aws/lambda/error-catcher-notifyOnError"
      ~ tags              = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "error-catcher"
            "Owner"       = "gaspi"
        }
      ~ tags_all          = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.error-catcher.module.lambda-notifyOnError.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
        id                    = "error-catcher-notifyOnError"
        name                  = "error-catcher-notifyOnError"
      ~ tags                  = {
          ~ "Environment" = "dev" -> "uat"
            "NAME"        = "error-catcher"
            "Owner"       = "gaspi"
        }
      ~ tags_all              = {
          ~ "Environment" = "dev" -> "uat"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.error-catcher.module.lambda-notifyOnError.aws_iam_role_policy.additional_json[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_json" {
        id          = "error-catcher-notifyOnError:error-catcher-notifyOnError"
        name        = "error-catcher-notifyOnError"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "cloudwatch:DescribeAlarms"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:cloudwatch:ap-southeast-3:496940679572:alarm:error-catcher-notifyOnError"
                    },
                  - {
                      - Action   = [
                          - "events:enableRule",
                          - "events:disableRule",
                          - "events:describeRule",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:events:ap-southeast-3:496940679572:rule/error-catcher-notifyOnError-trigger"
                    },
                  - {
                      - Action   = "s3:ListBucket"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::error-catcher-recent-errors-20250708001358184800000001"
                    },
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:GetObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::error-catcher-recent-errors-20250708001358184800000001/*"
                    },
                  - {
                      - Action   = [
                          - "cloudwatch:ListMetrics",
                          - "cloudwatch:GetMetricData",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "logs:FilterLogEvents"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:ap-southeast-3:496940679572:log-group:/aws/lambda/*"
                    },
                  - {
                      - Action   = "ses:SendEmail"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ses:ap-southeast-3:496940679572:identity/*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.error-catcher.module.lambda-notifyOnError.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/67a4687359bdb267c188068deb2acf0be566800eb6f0502ba512b9c0a31938c3.zip" -> "builds/2a659c5c68d0b5aade4d65d796c0c1cf81a569749317424275d2a0f412026e07.zip"
        id                             = "error-catcher-notifyOnError"
      ~ last_modified                  = "2025-07-15T04:02:01.000+0000" -> (known after apply)
      ~ tags                           = {
          ~ "Environment"           = "dev" -> "uat"
            "NAME"                  = "error-catcher"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
      ~ tags_all                       = {
          ~ "Environment"           = "dev" -> "uat"
            # (3 unchanged elements hidden)
        }
        # (26 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "SES_SOURCE_EMAIL"      = "dian.larasaty@xapiens.id" -> "gxcgaspi@gmail.com"
                # (6 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.error-catcher.module.lambda-notifyOnError.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "error_catcher/lambda/notifyOnError",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/2a659c5c68d0b5aade4d65d796c0c1cf81a569749317424275d2a0f412026e07.zip"
              + runtime       = "python3.13"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/2a659c5c68d0b5aade4d65d796c0c1cf81a569749317424275d2a0f412026e07.plan.json"
      + id                   = (known after apply)
    }

  # module.error-catcher.module.lambda-notifyOnError.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6761385668072196403" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/67a4687359bdb267c188068deb2acf0be566800eb6f0502ba512b9c0a31938c3.zip" -> "builds/2a659c5c68d0b5aade4d65d796c0c1cf81a569749317424275d2a0f412026e07.zip"
          ~ "timestamp" = "1752551935288602200" -> "1754022865353755000"
        }
    }

  # module.pgxflow[0].module.docker_image_qcFigures_lambda.aws_ecr_lifecycle_policy.this[0] must be replaced
-/+ resource "aws_ecr_lifecycle_policy" "this" {
      ~ id          = "svep-qcfigures-lambda-containers" -> (known after apply)
      ~ registry_id = "496940679572" -> (known after apply)
      ~ repository  = "svep-qcfigures-lambda-containers" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.docker_image_qcFigures_lambda.aws_ecr_repository.this[0] must be replaced
+/- resource "aws_ecr_repository" "this" {
      ~ arn                  = "arn:aws:ecr:ap-southeast-3:496940679572:repository/svep-qcfigures-lambda-containers" -> (known after apply)
      ~ id                   = "svep-qcfigures-lambda-containers" -> (known after apply)
      ~ name                 = "svep-qcfigures-lambda-containers" -> "pgxflow-qcfigures-lambda-containers" # forces replacement
      ~ registry_id          = "496940679572" -> (known after apply)
      ~ repository_url       = "496940679572.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers" -> (known after apply)
      - tags                 = {} -> null
      ~ tags_all             = {} -> (known after apply)
        # (3 unchanged attributes hidden)

      - encryption_configuration {
          - encryption_type = "AES256" -> null
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.pgxflow[0].module.docker_image_qcFigures_lambda.docker_image.this will be created
  + resource "docker_image" "this" {
      + force_remove = false
      + id           = (known after apply)
      + image_id     = (known after apply)
      + keep_locally = false
      + name         = (known after apply)
      + repo_digest  = (known after apply)
      + triggers     = {
          + "dir_sha" = "13151841c739bdf25ddfd5501dc985bdeba86abf"
        }

      + build {
          + build_args     = {
              + "SHARED_LAYER_PATH" = "pgxflow/shared_resources/python-modules/python/shared"
            }
          + cache_from     = []
          + context        = "pgxflow/lambda/qcFigures"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "linux/amd64"
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (12 unchanged attributes hidden)
        }
    }

  # module.pgxflow[0].module.docker_image_qcFigures_lambda.docker_registry_image.this must be replaced
+/- resource "docker_registry_image" "this" {
      ~ id                   = "sha256:06d80dfa6a566569566ea4eda9028fbf4801dced36823f3799101757d83c2a91" -> (known after apply)
      ~ name                 = "496940679572.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers" -> (known after apply) # forces replacement
      ~ sha256_digest        = "sha256:06d80dfa6a566569566ea4eda9028fbf4801dced36823f3799101757d83c2a91" -> (known after apply)
      ~ triggers             = { # forces replacement
          ~ "dir_sha" = "07eef377291eece3716f641cc7cad085ffa2e340" -> "13151841c739bdf25ddfd5501dc985bdeba86abf"
        }
        # (2 unchanged attributes hidden)
    }

  # module.pgxflow[0].module.lambda-batchStarter.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.pgxflow[0].module.lambda-batchStarter.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/pgxflow-backend-batchStarter"
      + name_prefix       = (known after apply)
      + region            = "ap-southeast-3"
      + retention_in_days = 0
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "uat"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all          = {
          + "Environment" = "uat"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
    }

  # module.pgxflow[0].module.lambda-batchStarter.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "pgxflow-backend-batchStarter"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "uat"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
      + tags_all              = {
          + "Environment" = "uat"
          + "NAME"        = "pgxflow-backend"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.pgxflow[0].module.lambda-batchStarter.aws_iam_role_policy.additional_jsons[0] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "pgxflow-backend-batchStarter-0"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "pgxflow-backend-batchStarter"
    }

  # module.pgxflow[0].module.lambda-batchStarter.aws_iam_role_policy.logs[0] will be created
  + resource "aws_iam_role_policy" "logs" {
      + id          = (known after apply)
      + name        = "pgxflow-backend-batchStarter-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "pgxflow-backend-batchStarter"
    }

  # module.pgxflow[0].module.lambda-batchStarter.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Scheduler for PGxFlow batch submissions"
      + filename                       = "builds/05b6f224dc95041ad642a459de8d44885297777ed3ef5af9e181d2be942af1c7.zip"
      + function_name                  = "pgxflow-backend-batchStarter"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = (known after apply)
      + memory_size                    = 1792
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "ap-southeast-3"
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment"           = "uat"
          + "NAME"                  = "pgxflow-backend"
          + "Owner"                 = "gaspi"
          + "terraform-aws-modules" = "lambda"
        }
      + tags_all                       = {
          + "Environment"           = "uat"
          + "NAME"                  = "pgxflow-b
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.